Repository: biblibre/sphinx-to-github-pages-with-drone
Catalog: documentation/locales/*/LC_MESSAGES/index.po
Languages: fr

source: How to build and publish a Sphinx documentation on GitHub Pages using Drone CI
fr: Comment construire et publier une documentation Sphinx sur GitHub Pages en utilisant Drone CI

source: To follow this tutorial you must have:
fr: Pour suivre ce tutoriel vous devez avoir:

source: a GitHub repository containing a Sphinx documentation located in ``documentation`` directory at the root of the repository,
fr: un dépôt GitHub contenant une documentation Sphinx sitée dans le répertoire ``documentation`` à la racine du dépôt,

source: a ``documentation/requirements.txt`` file containing Python dependencies,
fr: un fichier ``documentation/requirements.txt`` contenant les dépendances Python,

source: a ``documentation/conf.py`` file containing Sphinx configuration.
fr: un fichier ``documentation/conf.py`` contenant la configuration Sphinx.

source: Initialize ``gh-pages`` branch
fr: Initialiser la branche ``gh-pages``

source: The ``gh-pages`` will contain the generated documentation. We need to create it and add a few files in it::
fr: La branche ``gh-pages`` va contenir la documentation générée. On doit la créer et y ajouter quelques fichiers::

source: As an example, you can put the following content in ``index.html``::
fr: À titre d'exemple, vous pouvez mettre le contenu suivant dans ``index.html``::

source: Create a mirror on git.biblibre.com
fr: Créer un miroir sur git.biblibre.com

source: Since our Drone instance only works on git.biblibre.com, we need to create a mirror repository there.
fr: Puisque notre instance Drone fonctionne seulement sur git.biblibre.com, on doit créer un dépôt miroir ici.

source: Go to https://git.biblibre.com
fr: Allez sur https://git.biblibre.com

source: Click on the ``+`` sign in the top right corner and then ``New migration``
fr: Cliquez sur le signe ``+`` dans le coin supérieur droit puis ``Nouvelle migration``

source: Choose ``GitHub``
fr: Choisir ``GitHub``

source: Enter your repository URL and check ``This repository will be a mirror``
fr: Saisir l'URL du dépôt et cocher ``Ce dépôt sera un miroir``

source: Choose the right owner and repository name
fr: Choisir les bons propriétaire et nom de dépôt

source: Click the ``Migrate repository`` button
fr: Cliquer sur le bouton ``Migrer le dépôt``

source: Create a GitHub deploy key
fr: Créer une clé de déploiement GitHub

source: Drone will need to push to the GitHub repository. We need a deploy key for that. It's an SSH key that will be granted write access only for this repository.
fr: Drone va avoir besoin de pousser dans le dépôt GitHub. On a besoin d'une clé de déploiement pour ça. C'est une clé SSH qui aura un accès en écriture seulement pour ce dépôt.

source: Generate an SSH keys pair::
fr: Générer une paire de clés SSH::

source: Go to github repository's settings page and click on ``Deploy keys`` (or go directly to ``https://github.com/<USER>/<REPO>/settings/keys``)
fr: Aller sur la page des paramètres du dépôt GitHub et cliquer sur ``Deploy keys`` (ou aller directement sur ``https://github.com/<USER>/<REPO>/settings/keys``)

source: Click on ``Add a deploy key``
fr: Cliquer sur ``Add a deploy key``

source: Enter a title
fr: Saisir un titre

source: Copy the **public** key into the text area
fr: Copier la clé **publique** dans la zone de texte

source: Check ``Allow write access``
fr: Cocher ``Allow write access``

source: Configure Drone
fr: Configurer Drone

source: Go to https://drone.biblibre.com
fr: Aller sur https://drone.biblibre.com

source: Click on ``SYNC``
fr: Cliquer sur ``SYNC``

source: Once the synchronisation is done, search your module and click on ``Activate``
fr: Une fois la synchronisation terminée, chercher le module et cliquer sur ``Activate``

source: In the settings, check ``Disable pull requests`` and ``Disable forks``
fr: Dans les paramètres, cocher ``Disable pull requests`` et ``Disable forks``

source: Click on ``Save``
fr: Cliquer sur ``Save``

source: In the ``Secrets`` section, enter ``GH_DEPLOY_KEY`` in the ``Secret Name`` input, and copy the **private** key into the ``Secret Value`` input.
fr: Dans la section ``Secrets``, saisir ``GH_DEPLOY_KEY`` dans le champ ``Secret Name``, et copier la clé **privée** dans le champ ``Secret Value``.

source: Leave the ``Allow pull requests`` checkbox **unchecked**.
fr: Laisser la case à cocher ``Allow pull requests`` **décochée**.

source: Click on ``Add a secret``.
fr: Cliquer sur ``Add a secret``.

source: Add Drone configuration to your repository
fr: Ajouter la configuration Drone au dépôt

source: In your repository's main branch, add the following files:
fr: Dans la branche principale du dépôt, ajouter les fichiers suivants:

source: Do not forget to replace <USER> and <REPO> by the correct values
fr: Ne pas oublier de remplacer <USER> et <REPO> par les bonnes valeurs

source: Set the execution flag for shell scripts::
fr: Rendre les scripts exécutables::

source: Then commit and push::
fr: Puis valider et pousser::

source: Test it!
fr: Tester!

source: Everything is ready and the documentation should be automatically built when the mirror on git.biblibre.com get synchronized (once every 8 hours by default).
fr: Tout est prêt et la documentation devrait être automatiquement générée quand le miroir sur git.biblibre.com sera synchronisé (une fois toutes les 8 heures par défaut).

source: But you can test right now by manually triggering the synchronization. This option can be found in the mirror repository's settings.
fr: Mais il est possible de tester tout de suite en déclenchant manuellement la synchronisation. L'option se trouve dans les paramètres du dépôt miroir.
